{
  "architectures": [
    "DFlashDraftModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoModel": "dflash.DFlashDraftModel"
  },
  "block_size": 16,
  "dflash_config": {
    "mask_token_id": 120817,
    "target_layer_ids": [
      1,
      8,
      15,
      22
    ]
  },
  "dtype": "float32",
  "eos_token_id": 120007,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 3584,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 131072,
  "max_window_layers": 5,
  "model_type": "qwen3",
  "num_attention_heads": 16,
  "num_hidden_layers": 5,
  "num_key_value_heads": 8,
  "num_target_layers": 24,
  "pad_token_id": 120002,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 120818
}